RIOT-OS/RIOT/cpu/stm32/periph/usbdev_fs.c
/*
 * SPDX-FileCopyrightText: 2021 Mesotic SAS
 * SPDX-License-Identifier: LGPL-2.1-only
 */

/**
 * @ingroup cpu_stm32
 * @{
 * @file
 * @brief   Low level USB interface functions for the stm32 FS devices
 *
 * @author  Dylan Laduranty <dylan.laduranty@mesotic.com>
 * @}
 */

#define USB_H_USER_IS_RIOT_INTERNAL

#include <assert.h>
#include <stdint.h>
#include <stdlib.h>
#include <errno.h>

#include "bitarithm.h"
#include "cpu.h"
#include "cpu_conf.h"
#include "periph/pm.h"
#include "periph/gpio.h"
#include "periph/usbdev.h"
#include "usbdev_stm32.h"
#include "pm_layered.h"
#include "ztimer.h"
#include "busy_wait.h"

#include <string.h>
/**
 * Be careful with enabling debug here. As with all timing critical systems it
 * is able to interfere with USB functionality and you might see different
 * errors than debug disabled
 */
#define ENABLE_DEBUG 0
#include "debug.h"

#ifndef USB1_PMAADDR
#define USB1_PMAADDR USB_PMAADDR
#endif /* ndef USB1_PMAADDR */

/**
 * @brief   Map legacy F1 USB `USB_EP_*` / `CNTR` / `EPTX` symbol names to USB DRD
 *          (CHEP / CNTR) names in STM32U3 CMSIS headers.
 * @{
 */
#if defined(CPU_FAM_STM32U3) || defined(CPU_LINE_STM32U385xx) || \
    defined(CPU_LINE_STM32U385XX)
#ifndef USB_CNTR_FRES
#  define USB_CNTR_FRES             USB_CNTR_USBRST
#endif
#  ifndef USB_EPTX_DTOG1
#    define USB_EPTX_DTOG1          USB_CHEP_TX_DTOG1
#    define USB_EPTX_DTOG2          USB_CHEP_TX_DTOG2
#    define USB_EPRX_DTOG1          USB_CHEP_RX_DTOG1
#    define USB_EPRX_DTOG2          USB_CHEP_RX_DTOG2
#  endif
#  ifndef USB_EPTX_STAT
#    define USB_EPTX_STAT           USB_CHEP_TX_STTX
#  endif
#  ifndef USB_EPRX_STAT
#    define USB_EPRX_STAT           USB_CHEP_RX_STRX
#  endif
#  ifndef USB_EP_DTOG_TX
#    define USB_EP_DTOG_TX          USB_CHEP_DTOG_TX
#  endif
#  ifndef USB_EP_DTOG_RX
#    define USB_EP_DTOG_RX          USB_CHEP_DTOG_RX
#  endif
#  ifndef USB_EP_CTR_TX
#    define USB_EP_CTR_TX           USB_CHEP_VTTX
#  endif
#  ifndef USB_EP_CTR_RX
#    define USB_EP_CTR_RX           USB_CHEP_VTRX
#  endif
#endif /* U3 / U385 */
/** @} */

/**
 * There are two schemes for accessing the packet buffer area (PMA) from the CPU:
 *
 * - 2 x 16 bit/word access scheme where two 16-bit half-words per word can be
 *   accessed. With this scheme the access can be half-word aligned and the
 *   PMA address offset corresponds therefore to the local USB IP address.
 *   The size of the PMA SRAM is usually 1024 byte.
 * - 1 x 16 bit/word access scheme where one 16-bit half word per word can be
 *   accessed. With this scheme the access can only be word-aligned and the
 *   PMA address offset to a half-word is therefore twice the local USB IP
 *   address. The size of the PMA SRAM is usually 512 byte.
 *
 * Which access scheme is used depends on the STM32 model.
 */
#if defined(CPU_LINE_STM32F303xD) || defined(CPU_LINE_STM32F303xE) || \
    defined(CPU_LINE_STM32WB35xx) || defined(CPU_LINE_STM32WB55xx)

#define _ENDPOINT_NUMOF         (8)     /* Number of endpoints */
#define _PMA_SRAM_SIZE          (1024)  /* Size of Packet buffer Memory Area (PMA) SRAM */
#define _PMA_ACCESS_SCHEME      (2)     /* 2 x 16-bit/word */
#define _PMA_ACCESS_STEP_SIZE   (1)     /* Step size in 16-bit half-words when
                                         * accessing the PMA SRAM from CPU */
#elif defined(CPU_LINE_STM32F103xB) || \
      defined(CPU_LINE_STM32F303xB) || defined(CPU_LINE_STM32F303xC)

#define _ENDPOINT_NUMOF         (8)     /* Number of endpoints */
#define _PMA_SRAM_SIZE          (512)   /* Size of Packet buffer Memory Area (PMA) SRAM */
#define _PMA_ACCESS_SCHEME      (1)     /* 1 x 16-bit/word */
#define _PMA_ACCESS_STEP_SIZE   (2)     /* Step size in 16-bit half-words when
                                         * accessing the PMA SRAM from CPU */
#elif defined(CPU_LINE_STM32U385xx) || defined(CPU_LINE_STM32U385XX)

#define _ENDPOINT_NUMOF         (8)
#define _PMA_SRAM_SIZE          (2048)  /* see USB_DRD_PMA_SIZE in device header */
#define _PMA_ACCESS_SCHEME      (2)     /* 2 x 16-bit/word (USB DRD FS PMA) */
#define _PMA_ACCESS_STEP_SIZE   (1)     /* Step in 16-bit half-words when
                                         * accessing the PMA from CPU */
#else
#error "STM32 line is not supported"
#endif

/* USB IP local base address for the endpoints buffers in PMA SRAM */
#define _PMA_BUF_BASE_OFFSET    (_ENDPOINT_NUMOF * 8)

/* List of instantiated USB peripherals */
static stm32_usbdev_fs_t _usbdevs[USBDEV_NUMOF];

static usbdev_ep_t _ep_in[_ENDPOINT_NUMOF];
static usbdev_ep_t _ep_out[_ENDPOINT_NUMOF];

/* 16-bit addresses used by the USB IP as endpoint buffers in the PMA SRAM */
static uint16_t _ep_in_buf[_ENDPOINT_NUMOF];
static uint16_t _ep_out_buf[_ENDPOINT_NUMOF];

/* Buffers used for receiving packets on OUT EPs. */
static uint8_t* _app_pbuf[_ENDPOINT_NUMOF];

/* Forward declaration for the usb device driver */
const usbdev_driver_t driver;

/* STM32U3: USB full-speed is USB DRD (not legacy USB_TypeDef) — only this family */
#if defined(CPU_FAM_STM32U3) || defined(CPU_LINE_STM32U385xx) || \
    defined(CPU_LINE_STM32U385XX)
static USB_DRD_TypeDef *_global_regs(const stm32_usbdev_fs_config_t *conf)
{
    return (USB_DRD_TypeDef *)conf->base_addr;
}
#else
static USB_TypeDef *_global_regs(const stm32_usbdev_fs_config_t *conf)
{
    return (USB_TypeDef *)conf->base_addr;
}
#endif

#if _PMA_ACCESS_SCHEME == 1

/* Endpoint Buffer Descriptor for the 1 x 16-bit/word access scheme
 * (word-aligned access). Even though the members define 16-bit USB IP local
 * addresses, they have to be defined as 32-bit unsigned for word-aligned
 * access */
typedef struct {
    uint32_t addr_tx;       /* buffer address (16-bit USB IP local address) */
    uint32_t count_tx;      /* byte count (16-bit) */
    uint32_t addr_rx;       /* buffer address (16-bit USB IP local address) */
    uint32_t count_rx;      /* byte count (16-bit) */
} ep_buf_desc_t;

#elif _PMA_ACCESS_SCHEME == 2

/* Endpoint Buffer Descriptor for the 2 x 16-bits/word access scheme
 * (half-word-aligned access) */
typedef struct {
    uint16_t addr_tx;
    uint16_t count_tx;
    uint16_t addr_rx;
    uint16_t count_rx;
} ep_buf_desc_t;

#else
#error "_PMA_ACCESS_SCHEME is not defined"
#endif

/* Bit mask containing all toggleable bits in a EP_REG(x) register */
#define _EP_REG_TOGGLE_ONLY_BITS_MASK (USB_EP_DTOG_TX | USB_EP_DTOG_RX | \
                                       USB_EPTX_STAT  | USB_EPRX_STAT  )

